rovCase_u0.2/system/meshCuts
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

meshCuts
{
    type            surfaces;
    libs            ("libsampling.so");
    writeControl    writeTime;

    surfaceFormat   vtk;
    writeFormat     ascii;
    fields          (p);

    interpolationScheme cell;

    surfaces
    (
        yNormal
        {
            type            cutPlane;
            planeType       pointAndNormal;
            point           (0.2875 0.127 0.2286);
            normal          (0 1 0);
            interpolate     false;
        }
        xNormal
        {
            type            cutPlane;
            planeType       pointAndNormal;
            point           (0.2875 0.127 0.2286);
            normal          (1 0 0);
            interpolate     false;
        }
    );
}

// ************************************************************************* //
